usernamehw.errorlens
beardedbear.beardedicons
tintedtheming.base16-tinted-themes
enkia.tokyo-night
eamodio.gitlens
editorconfig.editorconfig
naumovs.color-highlight
oderwat.indent-rainbow
vscodevim.vim
ritwickdey.LiveServer
t7yang.dark-lavender

jnoortheen.nix-ide

ms-python.python
charliermarsh.ruff
ms-python.vscode-pylance

dbaeumer.vscode-eslint
esbenp.prettier-vscode
dsznajder.es7-react-js-snippets
bradlc.vscode-tailwindcss
formulahendry.auto-close-tag
formulahendry.auto-rename-tag
wix.glean
ms-vscode.vscode-typescript-next
nrwl.angular-console

Vue.volar

ms-azuretools.vscode-docker
exiasr.hadolint

mads-hartmann.bash-ide-vscode
timonwong.shellcheck

redhat.vscode-yaml

DavidAnson.vscode-markdownlint

sumneko.lua

theqtcompany.qt-qml
theqtcompany.qt-core
